s3/src/Catalogs/ТомаХраненияФайлов/ТомаХраненияФайлов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="d912e472-9553-4b96-8b16-7aaff6c14239">
  <name>ТомаХраненияФайлов</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>s3_ТипХранилища</name>
    <type>
      <types>EnumRef.s3_ТипыХранилищ</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_АдресХранилища</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИмяПрефикса</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИмяПрефиксаРабочаяБаза</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>s3_ИдентификаторКлючаДоступа</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_СекретныйКлюч</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>s3_Регион</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="d03d5b18-57a2-43c0-99ea-8ad9d5788179">
    <name>ПолныйПутьWindows</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="9283277f-2b75-4c3a-810a-8d4071b3afcc">
    <name>ПолныйПутьLinux</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="8f5af22e-3e73-4a4f-b91e-eccd0f5084fd">
    <name>МаксимальныйРазмер</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="c491a7fc-14f9-498a-b7dd-575dfc66878e">
    <name>ПорядокЗаполнения</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="b04018b5-a74d-43c9-8519-6cc8aa23fe09">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
</mdclass:Catalog>

s3/src/Enums/s3_ТипыХранилищ/s3_ТипыХранилищ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>s3_ТипыХранилищ</name>
  <comment>// + #s3 Иванов А.Б. 12.01.2021</comment>
  <enumValues>
    <name>СетеваяПапка</name>
  </enumValues>
  <enumValues>
    <name>ОбъектноеS3</name>
  </enumValues>
</mdclass:Enum>

s3/src/Catalogs/ТомаХраненияФайлов/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

&ИзменениеИКонтроль("ОбработкаПроверкиЗаполнения")
Процедура s3_ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	#Вставка
	Если s3_ТипХранилища = ПредопределенноеЗначение("Перечисление.s3_ТипыХранилищ.ОбъектноеS3") Тогда
		
		s3_API.ТомаХраненияФайлов_ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
		
		Возврат;	
		
	КонецЕсли;
	#КонецВставки

	Если ОбщегоНазначения.ПодсистемаСуществует("СтандартныеПодсистемы.ПрофилиБезопасности") Тогда
		
		МодульРаботаВБезопасномРежиме   = ОбщегоНазначения.ОбщийМодуль("РаботаВБезопасномРежиме");
		ИспользуютсяПрофилиБезопасности = МодульРаботаВБезопасномРежиме.ИспользуютсяПрофилиБезопасности();
		
	Иначе
		ИспользуютсяПрофилиБезопасности = Ложь;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПропуститьОсновнуюПроверкуЗаполнения") Тогда
	
		Если Не НомерПорядкаУникален(ПорядокЗаполнения, Ссылка) Тогда
			ТекстОшибки = НСтр("ru = 'Порядок заполнения не уникален - в системе уже есть том с таким порядком'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПорядокЗаполнения", "Объект", Отказ);
		КонецЕсли;
		
		Если МаксимальныйРазмер <> 0 Тогда
			ТекущийРазмерВБайтах = 0;
			Если Не Ссылка.Пустая() Тогда
				ТекущийРазмерВБайтах = РаботаСФайламиСлужебныйВызовСервера.ПодсчитатьРазмерФайловНаТоме(Ссылка);
			КонецЕсли;
			ТекущийРазмер = ТекущийРазмерВБайтах / (1024 * 1024);
			
			Если МаксимальныйРазмер < ТекущийРазмер Тогда
				ТекстОшибки = НСтр("ru = 'Максимальный размер тома меньше, чем текущий размер'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "МаксимальныйРазмер", "Объект", Отказ);
			КонецЕсли;
		КонецЕсли;
		
		Если ПустаяСтрока(ПолныйПутьWindows) И ПустаяСтрока(ПолныйПутьLinux) Тогда
			ТекстОшибки = НСтр("ru = 'Не заполнен полный путь'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПолныйПутьWindows", "Объект", Отказ);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПолныйПутьLinux",   "Объект", Отказ);
			Возврат;
		КонецЕсли;
		
		Если Не ИспользуютсяПрофилиБезопасности
		   И Не ПустаяСтрока(ПолныйПутьWindows)
		   И (    Лев(ПолныйПутьWindows, 2) <> "\\"
		      ИЛИ СтрНайти(ПолныйПутьWindows, ":") <> 0 ) Тогда
			
			ТекстОшибки = НСтр("ru = 'Путь к тому должен быть в формате UNC (\\servername\resource).'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОшибки, , "ПолныйПутьWindows", "Объект", Отказ);
			Возврат;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ДополнительныеСвойства.Свойство("ПропуститьПроверкуДоступаКПапке") Тогда
		ИмяПоляСПолнымПутем = "";
		ПолныйПутьТома = "";
		
		СистемнаяИнфо = Новый СистемнаяИнформация;
		ТипПлатформыСервера = СистемнаяИнфо.ТипПлатформы;
		Если ТипПлатформыСервера = ТипПлатформы.Windows_x86
		 ИЛИ ТипПлатформыСервера = ТипПлатформы.Windows_x86_64 Тогда
			
			ПолныйПутьТома = ПолныйПутьWindows;
			ИмяПоляСПолнымПутем = "ПолныйПутьWindows";
		Иначе
			ПолныйПутьТома = ПолныйПутьLinux;
			ИмяПоляСПолнымПутем = "ПолныйПутьLinux";
		КонецЕсли;
		
		ИмяКаталогаТестовое = ПолныйПутьТома + "ПроверкаДоступа\";
		
		Попытка
			СоздатьКаталог(ИмяКаталогаТестовое);
			УдалитьФайлы(ИмяКаталогаТестовое);
		Исключение
			ИнформацияОбОшибке = ИнформацияОбОшибке();
			
			Если ИспользуютсяПрофилиБезопасности Тогда
				ШаблонОшибки =
					НСтр("ru = 'Путь к тому некорректен.
					           |Возможно не настроены разрешения в профилях безопасности,
					           |или учетная запись, от лица которой работает
					           |сервер 1С:Предприятия, не имеет прав доступа к каталогу тома.
					           |
					           |%1'");
			Иначе
				ШаблонОшибки =
					НСтр("ru = 'Путь к тому некорректен.
					           |Возможно учетная запись, от лица которой работает
					           |сервер 1С:Предприятия, не имеет прав доступа к каталогу тома.
					           |
					           |%1'");
			КонецЕсли;
			
			ТекстОшибки = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ШаблонОшибки, КраткоеПредставлениеОшибки(ИнформацияОбОшибке));
			
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстОшибки, , ИмяПоляСПолнымПутем, "Объект", Отказ);
		КонецПопытки;
	КонецЕсли;
	
КонецПроцедуры

#КонецЕсли
